; domain
(define (domain gripper-typed)
   (:requirements :typing)
   (:types room ball gripper)
   (:constants left right - gripper)
   (:predicates (at-robby ?dummy - room ?r - room)
		(at ?dummy - ball ?b - ball ?r - room)
		(free ?dummy - gripper ?g - gripper)
		(carry ?dummy - ball ?o - ball ?g - gripper))

   (:action move
       :parameters  (?from ?to - room)
       :precondition (at-robby ?from ?from)
       :effect (and  (at-robby ?to ?to)
		     (not (at-robby ?from ?from))))



   (:action pick
       :parameters (?obj - ball ?room - room ?gripper - gripper)
       :precondition  (and  (at ?obj ?obj ?room) (at-robby ?room ?room) (free ?gripper ?gripper))
       :effect (and (carry ?obj ?obj ?gripper)
		    (not (at ?obj ?obj ?room))
		    (not (free ?gripper ?gripper))))


   (:action drop
       :parameters  (?obj - ball ?room - room ?gripper - gripper)
       :precondition  (and  (carry ?obj ?obj ?gripper) (at-robby ?room ?room))
       :effect (and (at ?obj ?obj ?room)
		    (free ?gripper ?gripper)
		    (not (carry ?obj ?obj ?gripper)))))

; problem
(define (problem gripper-x-11)
   (:domain gripper-typed)
   (:objects rooma roomb - room
             ball24 ball23 ball22 ball21 ball20 ball19 ball18 ball17 ball16
             ball15 ball14 ball13 ball12 ball11 ball10 ball9 ball8 ball7
             ball6 ball5 ball4 ball3 ball2 ball1 - ball)
   (:init (at-robby rooma rooma)
          (free left left)
          (free right right)
          (at ball24 ball24 rooma)
          (at ball23 ball23 rooma)
          (at ball22 ball22 rooma)
          (at ball21 ball21 rooma)
          (at ball20 ball20 rooma)
          (at ball19 ball19 rooma)
          (at ball18 ball18 rooma)
          (at ball17 ball17 rooma)
          (at ball16 ball16 rooma)
          (at ball15 ball15 rooma)
          (at ball14 ball14 rooma)
          (at ball13 ball13 rooma)
          (at ball12 ball12 rooma)
          (at ball11 ball11 rooma)
          (at ball10 ball10 rooma)
          (at ball9 ball9 rooma)
          (at ball8 ball8 rooma)
          (at ball7 ball7 rooma)
          (at ball6 ball6 rooma)
          (at ball5 ball5 rooma)
          (at ball4 ball4 rooma)
          (at ball3 ball3 rooma)
          (at ball2 ball2 rooma)
          (at ball1 ball1 rooma))
   (:goal (and (at ball24 ball24 roomb)
               (at ball23 ball23 roomb)
               (at ball22 ball22 roomb)
               (at ball21 ball21 roomb)
               (at ball20 ball20 roomb)
               (at ball19 ball19 roomb)
               (at ball18 ball18 roomb)
               (at ball17 ball17 roomb)
               (at ball16 ball16 roomb)
               (at ball15 ball15 roomb)
               (at ball14 ball14 roomb)
               (at ball13 ball13 roomb)
               (at ball12 ball12 roomb)
               (at ball11 ball11 roomb)
               (at ball10 ball10 roomb)
               (at ball9 ball9 roomb)
               (at ball8 ball8 roomb)
               (at ball7 ball7 roomb)
               (at ball6 ball6 roomb)
               (at ball5 ball5 roomb)
               (at ball4 ball4 roomb)
               (at ball3 ball3 roomb)
               (at ball2 ball2 roomb)
               (at ball1 ball1 roomb))))

; plan
1. (pick ball1 rooma left)
   deleted: (at ball1 ball1 rooma) (free left left)
   added: (carry ball1 ball1 left)
   goals met: 0 of 24
2. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 0 of 24
3. (drop ball1 roomb left)
   deleted: (carry ball1 ball1 left)
   added: (at ball1 ball1 roomb) (free left left)
   goals met: 1 of 24
4. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 1 of 24
5. (pick ball10 rooma left)
   deleted: (at ball10 ball10 rooma) (free left left)
   added: (carry ball10 ball10 left)
   goals met: 1 of 24
6. (pick ball11 rooma right)
   deleted: (at ball11 ball11 rooma) (free right right)
   added: (carry ball11 ball11 right)
   goals met: 1 of 24
7. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 1 of 24
8. (drop ball10 roomb left)
   deleted: (carry ball10 ball10 left)
   added: (at ball10 ball10 roomb) (free left left)
   goals met: 2 of 24
9. (drop ball11 roomb right)
   deleted: (carry ball11 ball11 right)
   added: (at ball11 ball11 roomb) (free right right)
   goals met: 3 of 24
10. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 3 of 24
11. (pick ball12 rooma left)
   deleted: (at ball12 ball12 rooma) (free left left)
   added: (carry ball12 ball12 left)
   goals met: 3 of 24
12. (pick ball13 rooma right)
   deleted: (at ball13 ball13 rooma) (free right right)
   added: (carry ball13 ball13 right)
   goals met: 3 of 24
13. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 3 of 24
14. (drop ball12 roomb left)
   deleted: (carry ball12 ball12 left)
   added: (at ball12 ball12 roomb) (free left left)
   goals met: 4 of 24
15. (drop ball13 roomb right)
   deleted: (carry ball13 ball13 right)
   added: (at ball13 ball13 roomb) (free right right)
   goals met: 5 of 24
16. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 5 of 24
17. (pick ball14 rooma left)
   deleted: (at ball14 ball14 rooma) (free left left)
   added: (carry ball14 ball14 left)
   goals met: 5 of 24
18. (pick ball15 rooma right)
   deleted: (at ball15 ball15 rooma) (free right right)
   added: (carry ball15 ball15 right)
   goals met: 5 of 24
19. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 5 of 24
20. (drop ball14 roomb left)
   deleted: (carry ball14 ball14 left)
   added: (at ball14 ball14 roomb) (free left left)
   goals met: 6 of 24
21. (drop ball15 roomb right)
   deleted: (carry ball15 ball15 right)
   added: (at ball15 ball15 roomb) (free right right)
   goals met: 7 of 24
22. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 7 of 24
23. (pick ball16 rooma left)
   deleted: (at ball16 ball16 rooma) (free left left)
   added: (carry ball16 ball16 left)
   goals met: 7 of 24
24. (pick ball17 rooma right)
   deleted: (at ball17 ball17 rooma) (free right right)
   added: (carry ball17 ball17 right)
   goals met: 7 of 24
25. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 7 of 24
26. (drop ball16 roomb left)
   deleted: (carry ball16 ball16 left)
   added: (at ball16 ball16 roomb) (free left left)
   goals met: 8 of 24
27. (drop ball17 roomb right)
   deleted: (carry ball17 ball17 right)
   added: (at ball17 ball17 roomb) (free right right)
   goals met: 9 of 24
28. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 9 of 24
29. (pick ball18 rooma left)
   deleted: (at ball18 ball18 rooma) (free left left)
   added: (carry ball18 ball18 left)
   goals met: 9 of 24
30. (pick ball19 rooma right)
   deleted: (at ball19 ball19 rooma) (free right right)
   added: (carry ball19 ball19 right)
   goals met: 9 of 24
31. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 9 of 24
32. (drop ball18 roomb left)
   deleted: (carry ball18 ball18 left)
   added: (at ball18 ball18 roomb) (free left left)
   goals met: 10 of 24
33. (drop ball19 roomb right)
   deleted: (carry ball19 ball19 right)
   added: (at ball19 ball19 roomb) (free right right)
   goals met: 11 of 24
34. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 11 of 24
35. (pick ball2 rooma left)
   deleted: (at ball2 ball2 rooma) (free left left)
   added: (carry ball2 ball2 left)
   goals met: 11 of 24
36. (pick ball20 rooma right)
   deleted: (at ball20 ball20 rooma) (free right right)
   added: (carry ball20 ball20 right)
   goals met: 11 of 24
37. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 11 of 24
38. (drop ball2 roomb left)
   deleted: (carry ball2 ball2 left)
   added: (at ball2 ball2 roomb) (free left left)
   goals met: 12 of 24
39. (drop ball20 roomb right)
   deleted: (carry ball20 ball20 right)
   added: (at ball20 ball20 roomb) (free right right)
   goals met: 13 of 24
40. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 13 of 24
41. (pick ball21 rooma left)
   deleted: (at ball21 ball21 rooma) (free left left)
   added: (carry ball21 ball21 left)
   goals met: 13 of 24
42. (pick ball22 rooma right)
   deleted: (at ball22 ball22 rooma) (free right right)
   added: (carry ball22 ball22 right)
   goals met: 13 of 24
43. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 13 of 24
44. (drop ball21 roomb left)
   deleted: (carry ball21 ball21 left)
   added: (at ball21 ball21 roomb) (free left left)
   goals met: 14 of 24
45. (drop ball22 roomb right)
   deleted: (carry ball22 ball22 right)
   added: (at ball22 ball22 roomb) (free right right)
   goals met: 15 of 24
46. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 15 of 24
47. (pick ball23 rooma left)
   deleted: (at ball23 ball23 rooma) (free left left)
   added: (carry ball23 ball23 left)
   goals met: 15 of 24
48. (pick ball24 rooma right)
   deleted: (at ball24 ball24 rooma) (free right right)
   added: (carry ball24 ball24 right)
   goals met: 15 of 24
49. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 15 of 24
50. (drop ball23 roomb left)
   deleted: (carry ball23 ball23 left)
   added: (at ball23 ball23 roomb) (free left left)
   goals met: 16 of 24
51. (drop ball24 roomb right)
   deleted: (carry ball24 ball24 right)
   added: (at ball24 ball24 roomb) (free right right)
   goals met: 17 of 24
52. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 17 of 24
53. (pick ball3 rooma left)
   deleted: (at ball3 ball3 rooma) (free left left)
   added: (carry ball3 ball3 left)
   goals met: 17 of 24
54. (pick ball4 rooma right)
   deleted: (at ball4 ball4 rooma) (free right right)
   added: (carry ball4 ball4 right)
   goals met: 17 of 24
55. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 17 of 24
56. (drop ball3 roomb left)
   deleted: (carry ball3 ball3 left)
   added: (at ball3 ball3 roomb) (free left left)
   goals met: 18 of 24
57. (drop ball4 roomb right)
   deleted: (carry ball4 ball4 right)
   added: (at ball4 ball4 roomb) (free right right)
   goals met: 19 of 24
58. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 19 of 24
59. (pick ball5 rooma left)
   deleted: (at ball5 ball5 rooma) (free left left)
   added: (carry ball5 ball5 left)
   goals met: 19 of 24
60. (pick ball6 rooma right)
   deleted: (at ball6 ball6 rooma) (free right right)
   added: (carry ball6 ball6 right)
   goals met: 19 of 24
61. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 19 of 24
62. (drop ball5 roomb left)
   deleted: (carry ball5 ball5 left)
   added: (at ball5 ball5 roomb) (free left left)
   goals met: 20 of 24
63. (drop ball6 roomb right)
   deleted: (carry ball6 ball6 right)
   added: (at ball6 ball6 roomb) (free right right)
   goals met: 21 of 24
64. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 21 of 24
65. (pick ball7 rooma left)
   deleted: (at ball7 ball7 rooma) (free left left)
   added: (carry ball7 ball7 left)
   goals met: 21 of 24
66. (pick ball8 rooma right)
   deleted: (at ball8 ball8 rooma) (free right right)
   added: (carry ball8 ball8 right)
   goals met: 21 of 24
67. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 21 of 24
68. (drop ball7 roomb left)
   deleted: (carry ball7 ball7 left)
   added: (at ball7 ball7 roomb) (free left left)
   goals met: 22 of 24
69. (drop ball8 roomb right)
   deleted: (carry ball8 ball8 right)
   added: (at ball8 ball8 roomb) (free right right)
   goals met: 23 of 24
70. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 23 of 24
71. (pick ball9 rooma left)
   deleted: (at ball9 ball9 rooma) (free left left)
   added: (carry ball9 ball9 left)
   goals met: 23 of 24
72. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 23 of 24
73. (drop ball9 roomb left)
   deleted: (carry ball9 ball9 left)
   added: (at ball9 ball9 roomb) (free left left)
   goals met: 24 of 24
